Documents/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Реализация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Реализация/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.Реализация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Дата,
	|	Реализация.Номер,
	|	Реализация.Контрагент,
	|	Реализация.Товары.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьШтрихкод					= Макет.ПолучитьОбласть("Штрихкод");
	ОбластьЗаголовок 				= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовокПодчеркивание	= Макет.ПолучитьОбласть("ЗаголовокПодчеркивание");
	ОбластьПоставщик 				= Макет.ПолучитьОбласть("Поставщик");
	ОбластьПокупатель 				= Макет.ПолучитьОбласть("Покупатель");
	ОбластьШапкаТаблицы 			= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы 			= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвалТаблицы 			= Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьСуммаПрописью 			= Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьСуммаПодчеркивание		= Макет.ПолучитьОбласть("СуммаПодчеркивание");
	ОбластьПодписи 					= Макет.ПолучитьОбласть("Подписи");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		// Вывод заголовка штрихкода
		ТабДок.Вывести(ОбластьШтрихкод);
		
		// Вывод заголовка формы
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ТабДок.Вывести(ОбластьЗаголовокПодчеркивание);
		ТабДок.Вывести(ОбластьПоставщик);
		ОбластьПокупатель.Параметры.Покупатель = Выборка.Контрагент;
		ТабДок.Вывести(ОбластьПокупатель);
		
		// Вывод таблицы
		ТабДок.Вывести(ОбластьШапкаТаблицы);

		ВыборкаТовары = Выборка.Товары.Выбрать();
		СуммаИтог = 0;
		КоличествоИтог = 0;
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьСтрокаТаблицы, ВыборкаТовары.Уровень());
			
			КоличествоИтог = КоличествоИтог + 1;
			СуммаИтог = СуммаИтог + ВыборкаТовары.Сумма;
		КонецЦикла;
		
		ОбластьПодвалТаблицы.Параметры.Всего = СуммаИтог;
		ТабДок.Вывести(ОбластьПодвалТаблицы);
		
		// Вывод итоговой строки и суммы прописью
		СуммаИтогПредставление = Формат(СуммаИтог, "ЧДЦ=2");
		ИтоговаяСтрока = "Всего наименований " + КоличествоИтог + ", на сумму " + СуммаИтогПредставление + " RUB";
		СуммаПрописью = ЧислоПрописью(СуммаИтог, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
		ОбластьСуммаПрописьюПараметры = Новый Структура("ИтоговаяСтрока, СуммаПрописью", ИтоговаяСтрока, СуммаПрописью);
		
		ОбластьСуммаПрописью.Параметры.Заполнить(ОбластьСуммаПрописьюПараметры);
		ТабДок.Вывести(ОбластьСуммаПрописью);
		
		ТабДок.Вывести(ОбластьСуммаПодчеркивание);
		
		// Вывод области подписей
		ОбластьПодписи.Параметры.ОтпускПроизвел = СтроковыеПреобразования.КраткоеИмяПользователя();
		ТабДок.Вывести(ОбластьПодписи);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
